src/Documents/ЗаданиеНаРаботу_стар/ЗаданиеНаРаботу_стар.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаРаботу_стар</name>
  <basedOn>Document.ПриемкаИРазмещение</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОтборИОтгрузка</types>
      <types>DocumentRef.ПриемкаИРазмещение</types>
      <types>DocumentRef.ПеремещениеПоСкладу</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадания</name>
    <type>
      <types>EnumRef.ВидЗаданияНаРаботу</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикПолучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалообработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задание</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПаллета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.СкладскиеЗоны</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЯчейки</name>
      <type>
        <types>EnumRef.ВидыСкладскихЯчеек</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПлан</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПланКуда</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидЗаданияНаРаботу/ВидЗаданияНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидЗаданияНаРаботу</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыСкладскихПеремещений/СтатусыСкладскихПеремещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСкладскихПеремещений</name>
  <enumValues>
    <name>Выполнение</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаданиеНаРаботу_стар/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемкаИРазмещение") Тогда
		// Заполнение шапки
		Дата = ТекущаяДата();
		Организация = ДанныеЗаполнения.Организация;                         
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ВидЗадания = Перечисления.ВидЗаданияНаРаботу.Приемка;
		ПоставщикПолучатель = ДанныеЗаполнения.Поставщик;
		Склад = ДанныеЗаполнения.Склад;
		//	Исполнитель = ДанныеЗаполнения.Исполнители[0].Работники;
		Для Каждого ТекстрокаРазмещение из ДанныеЗаполнения.Размещение Цикл
			НоваяСтрока = Задание.Добавить();
			НоваяСтрока.ВидЯчейки = ТекСтрокаРазмещение.ВидЯчейки;
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаРазмещение.ЕдиницаИзмерения;
			НоваяСтрока.Зона = ТекСтрокаРазмещение.Зона;
			НоваяСтрока.Количество = ТекСтрокаРазмещение.Количество;
			НоваяСтрока.КоличествоФакт = ТекСтрокаРазмещение.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаРазмещение.Номенклатура;
			НоваяСтрока.НомерПаллета = ТекСтрокаРазмещение.НомерПаллета;
			НоваяСтрока.ЯчейкаПлан = ТекСтрокаРазмещение.ЯчейкаПлан;
			НоваяСтрока.КоличествоФакт  = ТекСтрокаРазмещение.Количество;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтборИОтгрузка") Тогда
		Дата = ТекущаяДата();
		Организация = ДанныеЗаполнения.Организация;                         
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ВидЗадания = Перечисления.ВидЗаданияНаРаботу.Приемка;
		ПоставщикПолучатель = ДанныеЗаполнения.Получатель;
		Склад = ДанныеЗаполнения.Склад;
		//Исполнитель = ДанныеЗаполнения.Исполнители[0].Работники;
		Для Каждого ТекстрокаОтбор из ДанныеЗаполнения.Отбор Цикл
			
			НоваяСтрока = Задание.Добавить();
			НоваяСтрока.ВидЯчейки = ТекстрокаОтбор.ВидЯчейки;
			НоваяСтрока.ЕдиницаИзмерения = ТекстрокаОтбор.ЕдиницаИзмерения;
			НоваяСтрока.Зона = ТекстрокаОтбор.Зона;
			НоваяСтрока.Количество = ТекстрокаОтбор.Количество;
			НоваяСтрока.КоличествоФакт = ТекстрокаОтбор.Количество;
			НоваяСтрока.Номенклатура = ТекстрокаОтбор.Номенклатура;
			НоваяСтрока.НомерПаллета = ТекстрокаОтбор.НомерПаллета;
			НоваяСтрока.ЯчейкаПлан = ТекстрокаОтбор.ЯчейкаПлан;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеПоСкладу") Тогда
		Дата = ТекущаяДата();
		Организация = ДанныеЗаполнения.Организация;                         
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ВидЗадания = Перечисления.ВидЗаданияНаРаботу.Перемещение;//Приемка;
		//ДокументЗаданиеНаРаботу.ПоставщикПолучатель = Поставщик;
		Склад = ДанныеЗаполнения.Склад;
		//Исполнитель = ДанныеЗаполнения.Исполнители[0].Работники;
		Для Каждого ТекстрокаПеремещение из ДанныеЗаполнения.Перемещение Цикл
			НоваяСтрока = Задание.Добавить();
			//НоваяСтрока.ВидЯчейки = ТекстрокаПеремещение.ВидЯчейки;
			НоваяСтрока.ЕдиницаИзмерения = ТекстрокаПеремещение.ЕдиницаХраненияОстатков;
			//				НоваяСтрока.Зона = ТекстрокаПеремещение.Зона;
			НоваяСтрока.Количество = ТекстрокаПеремещение.КоличествоКПеремещению;
			НоваяСтрока.КоличествоФакт = ТекстрокаПеремещение.КоличествоФактическиПеремещенное;
			НоваяСтрока.Номенклатура = ТекстрокаПеремещение.Номенклатура;
			НоваяСтрока.НомерПаллета = ТекстрокаПеремещение.НомерПаллета;
			НоваяСтрока.ЯчейкаПлан = ТекстрокаПеремещение.ЯчейкаПланКуда;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
Процедура ЗаполнениеШапкиДокумента(Основание, ТекИсполнитель)
    Организация = Основание.Организация;
    ДокументОснование = Основание.Ссылка;
    Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриемкаИРазмещение") Тогда
        ВидЗадания = Перечисления.ВидЗаданияНаРаботу.Приемка;
        ПоставщикПолучатель = Основание.Поставщик;
        Склад = Основание.Склад;
        Исполнитель = ТекИсполнитель;
    КонецЕсли; 
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Если ЗначениеЗаполнено(ВремяОкончанияОбработки) Тогда
        Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеПоСкладу") Тогда
            ДокПеремещение = ДокументОснование.ПолучитьОбъект();
            ДокПеремещение.Статус =Перечисления.СтатусыСкладскихПеремещений.Завершено;
            ДокПеремещение.Записать(РежимЗаписиДокумента.Проведение);
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
